#task 2

# AI log: none

# ожидаю вывода каждого элемента
print("one", "two", "three")

# ожидаю вывода с разделением запятой one, two, three
print("one", "two", "three", sep=", ")

# ожидаю вывода с "..." после последнего элемента
print("one", "two", "three", end="...\n")

# ожидаю вывода элементов, разделённых запятой и после последнего элемента ...
print("one", "two", sep=", ", end="...")

# AI log: использовала для пояснения работы через терминал
# (какие команды использовать): создание файла, открытие, сохранение и запуск.


#task 3

# AI log: none

# Вывод двух букв "O" и "H"
print('#########\n#\t\t#\n#\t\t#\n#\t\t#\n#########')
print('\n#\t\t#\n#\t\t#\n#########\n#\t\t#\n#\t\t#', end="\n")


#task 5

# AI log: none

# Визитка
print("=======================================================================================")
print("Rostyslav", "Wroclaw","Python","                                                       |",sep=" | ", end="\n")
print("Выбрал python что бы научится автоматизировать процесы и в дальнейшем работать DevOps","|", sep=" ", end="\n")
print("=======================================================================================")
