#task 3

# AI log: none

# Вывод двух букв "O" и "H"
print('#########\n#\t\t#\n#\t\t#\n#\t\t#\n#########')
print('\n#\t\t#\n#\t\t#\n#########\n#\t\t#\n#\t\t#', end="\n")


#task 5

# AI log: none

# Визитка
print("=======================================================================================")
print("Rostyslav", "Wroclaw","Python","                                                       |",sep=" | ", end="\n")
print("Выбрал python что бы научится автоматизировать процесы и в дальнейшем работать DevOps","|", sep=" ", end="\n")
print("=======================================================================================")
