# очікую виведення кожного елементу
print("one", "two", "three")

# очікую виведення з розділенням комою one, two, three
print("one", "two", "three", sep= ", ")

# очікую виведення з "..." після останнього елемента
print("one", "two", "three", end="...\n")

# очікую виведення елементів розділених комою та пісня останнього елементу ...
print("one", "two", sep= ", ", end="...")

#AI log: використовувала для пояснення роботи через термінал
#(які команди викристовувати): сворення файлу, відкриття, збереження та запуск.
