# при запуску файлу report.py, блок (if __name__ == '__main__') виконається, а цей же блок з файлу prices не виконається,
# бо цей блок виконується лише коли файл викликають напряму, а prices викликається як додатковий модуль

# після запуску файлу report, я побачив виконнання блоку (if __name__ == '__main__') від поточного файлу,
# а цей же блок від файлу prices не виконався

# виконання файлу prices:
# 125.0, 58
# виконання файлу reports:
# Список цін зі знижкою: [1020.0, 764.15, 382.5]; Загальна сумма: 2166.65

# вони вивели різні результати, бо для кожного файлу блок (if __name__ == '__main__') різний, ну а також я преедава різні значення в ці блоки

from prices import with_discount, total, t

if __name__ == '__main__':

    prices = [1200, 899, 450]
    discount = 0.15

    prices_discount = [with_discount(price, discount) for price in prices]
    total_price = total(prices_discount)

    t()
    print(f"Список цін зі знижкою: {prices_discount}")
    t()
    print(f"Загальна сумма: {total_price}")
    t()

# AI log: самостійно написав модулі prices та report, розібрався з імпортами, list comprehensions та успішно спрогнозував
# і пояснив поведінку блоку __main__, ментор(AI) допоміг з логікою передачі аргументів, правильною ітерацією та тестовими викликами.
