# цикли для аналізу безпечної клітинки більше не повторюються,
# ми стоврили новий цикл while де функція read_move() лише повертає значення(row, col), що ввів гравець, а основна дія відбуваєтся в новому циклі програми

import random


def create_bombs(size, count=10):   # створюємо бомби, та позицію їх розташування на полі

    # size - розмір поля - квадрат = row(рядок) * column(стовбець)
    # count - к-ть бомб на полі

    bombs = set()                               # масив з кортежами розположення бомб на полі

    while len(bombs) < count:                   # умова виконується допоки к-ть бомб не дійшла до count

        # рандомним чином вибирається рядок та стовбець на полі
        bombs.add((random.randint(0, size - 1), random.randint(0, size - 1)))

    return bombs


def count_around(bombs, row, col):  # рахуємо к-ть бомб які розположені поруч (на відстані 1 ходу)

    around = 0                                  # лічильник к-ті бомб які знаходяться поряд

    for dr in (-1, 0, 1):                       # перебірка зліва вправо (рядок)

        # як це працює, бере (-1 по рядку і потім перебирає -1 до 1 по стовбцю,потім 2 по рядку перебирає -1 до 1 по стовбцю і т.д.)
        for dc in (-1, 0, 1):

            if (row + dr, col + dc) in bombs:   # перевірка чи збігається це розположення з розположенням бомби
                around += 1                     # якщо збігається то даємо в лічильник

    return around


def create_board(size):  # створюємо поле(з крапок) в вигляді списку

    # в першому циклі створюємо список крапками для заповнення ширини, а в другому копіємо ці рядки для заповнення висоти
    hidden = [["." for col in range(size)] for row in range(size)]
    return hidden


def print_board(board):  # відобржаємо поле

    print("   0 1 2 3 4 5 6 7")                 # Створюємо індекс поля рядків

    for row in range(len(board)):

        # Створюємо індекс поля стовбців, з пробілом щоб було красиво
        line = str(row) + " "

        # в переборці циклу з списку board беремо крапку, додаємо до індексу стовбців пробіл(щоб виглядало красиво) та додаємо крапку
        for cell in board[row]:
            line += " " + cell

        print(line)


def read_move(size):    # запитуємо хід, доки ввід не буде правильним, і повертаємо row, col

    while True:

        # запитуємо хід
        print(t)
        answer = input("Рядок і стовпець, наприклад 3 5: ").split()
        print(t)

        # перевіряємо чи ввід має два індекси та вони є числами
        if len(answer) != 2 or not answer[0].isdigit() or not answer[1].isdigit():
            print(f"Введіть два числа від 0 до {size-1}")
            continue

        # переводимо числа з str в int, та запаковуємо в змінні
        row, col = int(answer[0]), int(answer[1])

        if row >= size or col >= size:
            print("Ця комірка знаходиться за межами таблиці")
            continue

        return row, col


t = '-' * 30

SIZE = 8    # наш розмір поля, квадрат (row(рядок) * column(стовбець))
BOMBS = 10  # к-ть бомб на полі

bombs = create_bombs(SIZE, BOMBS)           # генеруємо розміщення бомб
board = create_board(SIZE)                  # генеруємо поле

opened = 0  # лічильник відкритих клітинок (правильних ходів)

# Запускаємо нашу програму (буде працювати до поки не знайдемо всі правильні ходи за лічильником)
while opened < SIZE * SIZE - BOMBS:

    print_board(board)                      # відображуємо ігрове поле

    row, col = read_move(SIZE)              # запитуємо хід гравця

    if board[row][col] != ".":              # якщо клітинка вже чимося зайнята, то пропускаємо її
        print(t)
        print("Ця комірка вже відкрита")
        continue

    if (row, col) in bombs:                 # натрапили на бомбу, та програли
        print(t)
        print("Boom! Game over.")
        break

    # Якщо це правильний хід додаємо в лічильник
    board[row][col] = str(count_around(bombs, row, col))
    opened += 1

else:                                       # якщо не виконалась одна з умов вище, то ми перемогли
    print(t)
    print("You win!")

for row, col in bombs:                      # замінюємо клітинки з бомбами . на *
    board[row][col] = "*"

print_board(board)

# AI log: Спочатку ментор(AI) покроково поясняв мені як працює кожна частина коду, потім писав по малим його підказкам,
# а потім переписав вже сам з нуля, наче зрозумів як все працює, але сам би не зміг додуматись написати таку логіку.

# Проблеми з якими зіткнувся:
# - складно було зрозуміти як працюють цикли перевірки бомб, які знаходяться поруч
# - забув, що range() приймає тільки числа, і передавав у нього список.
# - заплутався з відступами: print малював поле "драбинкою", а else спрацьовував зарано.
# - переплутав порядок аргументів (передав міни на місце розміру поля).
# - намагався робити перевірку поля всередині read_move().
