# Усі апельсини коштують 32*1,5 = 48, загальна сума 6*4 + 0*2 + 48 + 15 *3 = 117

stock = {
    "banana": 6,
    "apple": 0,
    "orange": 32,
    "pear": 15
}

prices = {
    "banana": 4,
    "apple": 2,
    "orange": 1.5,
    "pear": 3
}

# перший варіант запису через цикл for
# total = 0
# for fruit, amount in stock.items():
#     total += prices[fruit] * amount

# другий варіант запису через використання генератора
total = sum(prices[fruit] * amount for fruit, amount in stock.items())

print("Загальна вартість запасів:", total)

# AI log: спочтаку написав простий варіант, вручну присвоюав новим змінним значення від stock та prices,
# а потім вже робив їхнє сумування та множення, авжеш ментор(AI) сказав що це не зручний спосіб і завдання потребує іншого методу через цикли.
# Після цього я спробував витягнути дані у списки через метод .items(), але зрозумів,
# що так втрачається головна перевага словника — швидкий доступ за ключем. Потім написав цикл for із накопиченням суми у змінну total.
# У фіналі оптимізував рішення: замінив цикл на генераторний вираз усередині функції sum().
