# дружба: 1
# не: 1
# кількість: 1
# часу: 2
# який: 1
# ви: 1
# проводите: 1
# а: 1
# якість: 1
# цього: 1

sentence = "Дружба не кількість Часу який ви проводите а якість цього часу"

sentence_dict = {}

word_list = sentence.lower().split()

for word in word_list:
    amount = word_list.count(word)
    sentence_dict[word] = amount

print(sentence_dict)

# AI log: Самостійно реалізував логіку лічильника слів. За допомогою ментора(AI) виправив дві помилки.
# 1) Логічну: застосовував .count() до рядка, тому він рахував окремі букви замість слів. Виправив, застосувавши метод до списку.
# 2) Синтаксичну (TypeError): намагався передати аргумент у метод через квадратні дужки .count[x] замість круглих .count(x).
