# перші три числа (7, 14, 21) - вони діляться на 7,
# 35 не потрапить бо воно кратне 5, тобто ділиться на 5

my_list = list(range(1, 101))

i = 0

new_list = []

while i < len(my_list):

    a = my_list[i]

    if a % 7 == 0 and a % 5 != 0:

        new_list.append(a)

    i += 1

print(new_list)

# AI log: на початку плутав індекси зі значеннями, через що створив нескінченний цикл із зайвим while.
# Також намагався викликати метод .append[] замість .append() і забув, як працює остача від ділення (%).
# Після розбору з ментором, самостійно видалив зайве і зібрав правильну логіку.
# Ментор AI (лише наштовхує мене на рішення, але не пише код за мене)
