# AI log: зіткнувся з труднощами під час реалізації підтримки від'ємного кроку та динамічних меж у власному генераторі range.
# Завдяки підказкам ментора(AI) проаналізував логіку роботи умов циклу while для різних напрямків руху.
# Самостійно дійшов висновку про необхідність розділення логіки та реалізував окремі сценарії для додатного й від'ємного кроку
# через перевірки step > 0 та step < 0, що забезпечило повну сумісність із поведінкою стандартної функції range.

# list(in_range(10, 0, -3)) - виведе [10, 7, 4]
# list(in_range(5, 1)) - виведе [], бо заданий крок за замовчуванням 1, тому цикл не зможе пройти ні одного значення

def in_range(start, end, step=1):

    if step == 0:
        raise ValueError("Крок не може бути 0.")

    if step > 0:

        while start < end:

            yield start
            start += step

    if step < 0:

        while start > end:

            yield start
            start += step


print(list(in_range(10, 0, -3)))    # [10, 7, 4, 1]
print(list(range(10, 0, -3)))       # [10, 7, 4, 1]

print(list(in_range(5, 1)))         # []
print(list(range(5, 1)))            # []
