# AI log:
# запитав чи правильно виконав завдання, він мені вказав на помилку у використанні змінної is_even (вона мала зберігати булеве True/False, а не int),
# порекомендував використати структуру коду через if / else, а я писав як if is_even (== / !=).

# Програма для значення 0 - виведе що значення є парним, для значення -7 - виведе що значення є не парним

# cпочатку отримав помилку TypeError: not all arguments converted during string formatting
# додав перетворення в int для змінної is_even

number = int(input("Введіть ваше значення: "))

is_even = number % 2 == 0

if is_even:
    print(f"Задане число ({number}) є парним.")

else:
    print(f"Задане число ({number}) є непарним.")
