# AI log: зіткнувся з труднощами під час роботи генераторної функції even_squares та вичерпання ітератора squares.
# Завдяки підказкам ментора(AI) проаналізував логіку роботи інструкції return усередині циклу та поведінку одноразових ітераторів (one-pass).
# Самостійно дійшов висновку про необхідність заміни return на yield та перетворення ітератора на список за допомогою list(),
# що дозволило успішно виправити обидві помилки та забезпечити коректне виконання всіх інструкцій print.

def even_squares(numbers):

    for n in numbers:

        if n % 2 == 0:
            yield n * n


# Bug 1: помилка в тому що в циклі for був return, який завершав цикл на першому проході, і не проходив всі значення
# замінив return на yield, щоб утворився генератор, який пройде всі числа
evens = even_squares(range(10))

print(list(evens))    # квадрати парних чисел (0-9): [0, 4, 16, 36, 64]

# Bug 1: помилка в тому що, використання генератора, переводить курсор в кінець списку, і він більше не бачить чисел,
# через що він при повторному виклику видає 0 чисел
# тому є два варіанти вирішення: або перетворити генератор в лист(і вже працювати з листом), або повторно створити генератор
squares = list((n * n for n in range(5)))

print(max(squares))   # 16 - максимальне значення
print(sum(squares))   # сума квадратів чисел від (0-4): 0 + 1 + 4 + 9 + 16 = 30
