def make_country(name, capital):
    country = {
        "name": name,
        "capital": capital
    }
    return country
#Виклик із позиційними аргументами.
print(make_country("Україна", "Київ"))
#Виклик з іменованими аргументами в іншому порядку.
print(make_country(capital="Київ", name="Україна"))
# make_country("Київ", "Україна") поверне словник,
# де name буде "Київ", а capital буде "Україна",
# оскільки позиційні аргументи передаються за порядком.
# AI log: Попросив ШІ пояснити словники, параметри функцій,
# позиційні та іменовані аргументи.