# різниця між print(get_greeter()) та print(get_greeter()(«Olena») в тому, що в першому випадку ми відображуємо посилання на цю фукцію в пам'яті,
# а в другому викликаємо цю функцію та передаємо їй параметр


def get_greeter():

    def wrapper(name):

        if name:
            return f"Привіт, {name}"
        else:
            return 'Привіт'

    return wrapper


print(get_greeter())
print(get_greeter()("Olena"))

# AI log: Синтаксис замикань та декораторів поки дається складно, але за допомогою ментора(AI) розібрав ключові помилки.
# Зокрема, замінив декоратор на звичайне замикання та зрозумів різницю між об'єктом функції (без дужок) та її викликом (з дужками).
